Repository: jianwushu/FileUpload
Catalog: Resources/Strings.*.resx
Languages: ja, vi, zh_hant

# Menu_File
source: &File
ja: ファイル(&F)
vi: Tệp(&F)
zh_hant: 檔案(&F)

# Menu_Config
source: &Configuration
ja: システム設定(&C)
vi: Cấu hình hệ thống(&C)
zh_hant: 系統配置(&C)

# Menu_Exit
source: E&xit
ja: 終了(&X)
vi: Thoát(&X)
zh_hant: 退出(&X)

# Menu_Help
source: &Help
ja: ヘルプ(&H)
vi: Trợ giúp(&H)
zh_hant: 幫助(&H)

# Menu_About
source: &About
ja: バージョン情報(&A)
vi: Giới thiệu(&A)
zh_hant: 關於(&A)

# Form_Title
source: File Upload System
ja: ファイルアップロードシステム
vi: Hệ thống tải lên tệp
zh_hant: 檔案上傳系統

# Form_WindowTitle
source: File Upload System v2.0
ja: ファイルアップロードシステム v2.0
vi: Hệ thống tải lên tệp v2.0
zh_hant: 檔案上傳系統 v2.0

# Config_Title
source: Configuration Information
ja: 設定情報
vi: Thông tin cấu hình
zh_hant: 配置資訊

# Label_DeviceId
source: Device ID:
ja: デバイスID：
vi: Mã thiết bị：
zh_hant: 設備編號：

# Label_WatchFolder
source: Watch Folder:
ja: 監視フォルダ：
vi: Thư mục giám sát：
zh_hant: 監控資料夾：

# Label_UploadUrl
source: Upload URL:
ja: アップロードURL：
vi: URL tải lên：
zh_hant: 上傳介面：

# Label_ParseRule
source: Parse Rule:
ja: 解析ルール：
vi: Quy tắc phân tích：
zh_hant: 解析規則：

# Label_Status
source: Status:
ja: ステータス：
vi: Trạng thái：
zh_hant: 狀態：

# Status_NotRunning
source: Not Running
ja: 停止中
vi: Chưa chạy
zh_hant: 未運行

# Status_Running
source: Running
ja: 実行中
vi: Đang chạy
zh_hant: 運行中

# Label_Total
source: Total Files:
ja: 総ファイル数：
vi: Tổng tệp：
zh_hant: 總檔案：

# Label_Success
source: Success:
ja: 成功数：
vi: Thành công：
zh_hant: 成功數：

# Label_Failed
source: Failed:
ja: 失敗数：
vi: Thất bại：
zh_hant: 失敗數：

# Button_Start
source: Start Task
ja: タスク開始
vi: Bắt đầu tác vụ
zh_hant: 開始任務

# Button_Stop
source: Stop Task
ja: タスク停止
vi: Dừng tác vụ
zh_hant: 停止任務

# Log_Title
source: Log Information
ja: ログ情報
vi: Thông tin nhật ký
zh_hant: 日誌資訊

# Button_ClearLog
source: Clear Log
ja: ログクリア
vi: Xóa nhật ký
zh_hant: 清空日誌

# ConfigForm_Title
source: System Configuration
ja: システム設定
vi: Cấu hình hệ thống
zh_hant: 系統配置

# Tab_Basic
source: Basic Configuration
ja: 基本設定
vi: Cấu hình cơ bản
zh_hant: 基本配置

# Tab_Advanced
source: Advanced Configuration
ja: 詳細設定
vi: Cấu hình nâng cao
zh_hant: 進階配置

# Tab_Performance
source: Performance Optimization
ja: パフォーマンス最適化
vi: Tối ưu hóa hiệu suất
zh_hant: 效能優化

# Label_DeviceIdConfig
source: Device ID:
ja: デバイスID:
vi: Mã thiết bị:
zh_hant: 設備編號:

# Label_UploadUrlConfig
source: Upload URL:
ja: アップロードURL:
vi: URL tải lên:
zh_hant: 上傳介面URL:

# Label_AllowedExtensions
source: Allowed File Extensions:
ja: 許可するファイル拡張子:
vi: Phần mở rộng tệp được phép:
zh_hant: 允許的檔案副檔名:

# Label_RequestTimeout
source: Request Timeout (seconds):
ja: リクエストタイムアウト(秒):
vi: Thời gian chờ yêu cầu(giây):
zh_hant: 請求逾時時間(秒):

# Label_ScanInterval
source: File Scan Interval (seconds):
ja: ファイルスキャン間隔(秒):
vi: Khoảng thời gian quét tệp(giây):
zh_hant: 檔案掃描間隔(秒):

# Label_MaxRetryCount
source: Max Retry Count:
ja: 最大リトライ回数:
vi: Số lần thử lại tối đa:
zh_hant: 最大重試次數:

# Label_WatchFolders
source: Watch Folders List:
ja: 監視フォルダリスト:
vi: Danh sách thư mục giám sát:
zh_hant: 監控資料夾清單:

# Label_WatchFoldersList
source: Watch Folders List:
ja: 監視フォルダリスト:
vi: Danh sách thư mục giám sát:
zh_hant: 監控資料夾清單:

# Button_AddFolder
source: Add Folder
ja: フォルダ追加
vi: Thêm thư mục
zh_hant: 新增資料夾

# Button_RemoveFolder
source: Remove Folder
ja: フォルダ削除
vi: Xóa thư mục
zh_hant: 移除資料夾

# CheckBox_ScanSubfolders
source: Recursively scan subfolders (scan all nested directories)
ja: サブフォルダを再帰的にスキャン(すべてのネストされたディレクトリをスキャン)
vi: Quét đệ quy các thư mục con (quét tất cả các thư mục lồng nhau)
zh_hant: 遞迴掃描子資料夾(掃描所有巢狀目錄)

# Label_ScanSubfolders
source: Recursively scan subfolders (scan all nested directories)
ja: サブフォルダを再帰的にスキャン（すべてのネストされたディレクトリをスキャン）
vi: Quét đệ quy các thư mục con (quét tất cả các thư mục lồng nhau)
zh_hant: 遞迴掃描子資料夾（掃描所有巢狀目錄）

# CheckBox_PreserveDirectory
source: Preserve directory structure when moving to OK/NG
ja: OK/NGに移動する際にディレクトリ構造を保持
vi: Giữ cấu trúc thư mục khi di chuyển đến OK/NG
zh_hant: 移動到OK/NG時保留目錄結構

# Label_PreserveDirectoryStructure
source: Preserve directory structure when moving to OK/NG
ja: OK/NGに移動する際にディレクトリ構造を保持
vi: Giữ cấu trúc thư mục khi di chuyển đến OK/NG
zh_hant: 移動到OK/NG時保留目錄結構

# Group_SystemTray
source: System Tray Configuration
ja: システムトレイ設定
vi: Cấu hình khay hệ thống
zh_hant: 系統托盤配置

# CheckBox_SystemTrayEnabled
source: Enable system tray functionality
ja: システムトレイ機能を有効にする
vi: Bật chức năng khay hệ thống
zh_hant: 啟用系統托盤功能

# Label_EnableSystemTray
source: Enable system tray functionality
ja: システムトレイ機能を有効にする
vi: Bật chức năng khay hệ thống
zh_hant: 啟用系統托盤功能

# CheckBox_MinimizeToTray
source: Automatically hide to tray when minimized
ja: 最小化時に自動的にトレイに隠す
vi: Tự động ẩn vào khay khi thu nhỏ
zh_hant: 最小化時自動隱藏到托盤

# Label_MinimizeToTray
source: Automatically hide to tray when minimized
ja: 最小化時に自動的にトレイに隠す
vi: Tự động ẩn vào khay khi thu nhỏ
zh_hant: 最小化時自動隱藏到托盤

# Label_CloseAction
source: Action when closing window:
ja: ウィンドウを閉じる時の動作:
vi: Hành động khi đóng cửa sổ:
zh_hant: 關閉視窗時的行為:

# CloseAction_Ask
source: Ask User
ja: ユーザーに確認
vi: Hỏi người dùng
zh_hant: 詢問使用者

# CloseAction_Minimize
source: Minimize to Tray
ja: トレイに最小化
vi: Thu nhỏ vào khay
zh_hant: 最小化到托盤

# CloseAction_Exit
source: Exit Directly
ja: 直接終了
vi: Thoát trực tiếp
zh_hant: 直接退出

# Group_ThreadPool
source: Thread Pool Configuration
ja: スレッドプール設定
vi: Cấu hình thread pool
zh_hant: 執行緒池配置

# CheckBox_EnableThreadPool
source: Enable thread pool (for concurrent processing of large number of files)
ja: スレッドプールを有効にする(大量のファイルを並行処理)
vi: Bật thread pool (để xử lý đồng thời nhiều tệp)
zh_hant: 啟用執行緒池(用於並行處理大量檔案)

# Label_EnableThreadPool
source: Enable thread pool (for concurrent processing of large number of files)
ja: スレッドプールを有効にする（大量のファイルを並行処理）
vi: Bật thread pool (để xử lý đồng thời nhiều tệp)
zh_hant: 啟用執行緒池（用於並行處理大量檔案）

# Label_ThreadPoolSize
source: Thread Pool Size (concurrency count):
ja: スレッドプールサイズ（並行数）:
vi: Kích thước thread pool (số lượng đồng thời):
zh_hant: 執行緒池大小（並行數量）:

# Group_ImageCompression
source: Image Compression Configuration
ja: 画像圧縮設定
vi: Cấu hình nén hình ảnh
zh_hant: 圖片壓縮配置

# CheckBox_EnableImageCompression
source: Enable image compression (automatically compress large images)
ja: 画像圧縮を有効にする(大きな画像を自動圧縮)
vi: Bật nén hình ảnh (tự động nén hình ảnh lớn)
zh_hant: 啟用圖片壓縮(自動壓縮大圖片)

# Label_EnableImageCompression
source: Enable image compression (automatically compress large images)
ja: 画像圧縮を有効にする（大きな画像を自動圧縮）
vi: Bật nén hình ảnh (tự động nén hình ảnh lớn)
zh_hant: 啟用圖片壓縮（自動壓縮大圖片）

# Label_CompressionThreshold
source: Compression Threshold (KB, compress if larger than this value):
ja: 圧縮しきい値（KB、この値より大きい場合圧縮）:
vi: Ngưỡng nén (KB, nén nếu lớn hơn giá trị này):
zh_hant: 壓縮閾值（KB，大於此值將壓縮）:

# Label_CompressionQuality
source: Compression Quality (1-100, smaller value means higher compression):
ja: 圧縮品質（1-100、値が小さいほど圧縮率が高い）:
vi: Chất lượng nén (1-100, giá trị càng nhỏ tỷ lệ nén càng cao):
zh_hant: 壓縮品質（1-100，值越小壓縮率越高）:

# Button_Save
source: Save
ja: 保存
vi: Lưu
zh_hant: 儲存

# Button_Cancel
source: Cancel
ja: キャンセル
vi: Hủy
zh_hant: 取消

# Label_Language
source: Interface Language:
ja: インターフェース言語:
vi: Ngôn ngữ giao diện:
zh_hant: 介面語言:

# AboutForm_Title
source: About
ja: バージョン情報
vi: Giới thiệu
zh_hant: 關於

# About_Title
source: File Upload System
ja: ファイルアップロードシステム
vi: Hệ thống tải lên tệp
zh_hant: 檔案上傳系統

# About_WindowTitle
source: About
ja: バージョン情報
vi: Giới thiệu
zh_hant: 關於

# About_Version
source: Version: 2.0
ja: バージョン: 2.0
vi: Phiên bản: 2.0
zh_hant: 版本: 2.0

# About_Description
source: A file upload application based on .NET 6.0 Windows Forms
ja: .NET 6.0 Windows Formsベースのファイルアップロードアプリケーション
vi: Ứng dụng tải lên tệp dựa trên .NET 6.0 Windows Forms
zh_hant: 一個基於 .NET 6.0 Windows Forms 的檔案上傳應用程式

# About_Features
source: Main Features: ✓ Can upload images
ja: 主な機能: ✓ 画像をアップロードできます
vi: Chức năng chính: ✓ Có thể tải lên hình ảnh
zh_hant: 主要功能: ✓ 可以傳圖片

# About_Copyright
source: © 2025 File Upload System. Powered by LUX EAP TEAM. All rights reserved.
ja: © 2025 ファイルアップロードシステム.Powered by LUX EAP TEAM. All rights reserved.
vi: © 2025 Hệ thống tải lên tệp.Powered by LUX EAP TEAM. All rights reserved.
zh_hant: © 2025 檔案上傳系統.Powered by LUX EAP TEAM. All rights reserved.

# Button_Close
source: Close
ja: 閉じる
vi: Đóng
zh_hant: 關閉

# Message_ConfigSaved
source: Configuration saved successfully! Do you want to restart the program now to apply the configuration?
ja: 設定が正常に保存されました！ 設定を有効にするためにプログラムを再起動しますか？
vi: Cấu hình đã được lưu thành công！ Bạn có muốn khởi động lại chương trình ngay để áp dụng cấu hình không？
zh_hant: 配置已儲存成功！ 是否立即重新啟動程式以使配置生效？

# Message_ConfigSavedTitle
source: Configuration Saved
ja: 設定が保存されました
vi: Cấu hình đã được lưu
zh_hant: 配置已儲存

# Message_Error
source: Error
ja: エラー
vi: Lỗi
zh_hant: 錯誤

# Message_Success
source: Success
ja: 成功
vi: Thành công
zh_hant: 成功

# Message_Warning
source: Warning
ja: 警告
vi: Cảnh báo
zh_hant: 警告

# Message_Info
source: Information
ja: 情報
vi: Thông tin
zh_hant: 提示

# Message_Confirm
source: Confirm
ja: 確認
vi: Xác nhận
zh_hant: 確認

# Message_NotConfigured
source: Not Configured
ja: 未設定
vi: Chưa cấu hình
zh_hant: 未配置

# Message_FolderExists
source: This folder is already in the watch list
ja: このフォルダは既に監視リストに含まれています
vi: Thư mục này đã có trong danh sách giám sát
zh_hant: 該資料夾已在監控清單中

# Message_SelectFolder
source: Please select a folder to remove first
ja: 削除するフォルダを選択してください
vi: Vui lòng chọn thư mục cần xóa trước
zh_hant: 請先選擇要移除的資料夾

# Message_MinimizeToTray
source: Do you want to minimize to system tray? Click "Yes" to minimize to tray Click "No" to exit the program
ja: システムトレイに最小化しますか？ 「はい」をクリックするとトレイに最小化 「いいえ」をクリックするとプログラムを終了
vi: Bạn có muốn thu nhỏ vào khay hệ thống không? Nhấp "Có" để thu nhỏ vào khay Nhấp "Không" để thoát chương trình
zh_hant: 是否最小化到系統托盤? 點擊"是"最小化到托盤 點擊"否"退出程式

# Tray_ShowMainWindow
source: Show Main Window
ja: メインウィンドウを表示
vi: Hiển thị cửa sổ chính
zh_hant: 顯示主視窗

# Tray_StartTask
source: Start Task
ja: タスク開始
vi: Bắt đầu tác vụ
zh_hant: 開始任務

# Tray_StopTask
source: Stop Task
ja: タスク停止
vi: Dừng tác vụ
zh_hant: 停止任務

# Tray_OpenConfig
source: Open Configuration
ja: 設定を開く
vi: Mở cấu hình
zh_hant: 開啟配置

# Tray_Exit
source: Exit Program
ja: プログラムを終了
vi: Thoát chương trình
zh_hant: 退出程式

# Tray_MinimizedMessage
source: Program has been minimized to system tray
ja: プログラムはシステムトレイに最小化されました
vi: Chương trình đã được thu nhỏ vào khay hệ thống
zh_hant: 程式已最小化到系統托盤
